In [2]:
import saspy
import pandas as pd
import numpy as np
import math

In [3]:
sas = saspy.SASsession()
sas

Using SAS Config named: oda
SAS Connection established. Subprocess id is 5997

Access Method         = IOM
SAS Config name       = oda
SAS Config file       = /home/vlad/.miniconda3/lib/python3.7/site-packages/saspy/sascfg_personal.py
WORK Path             = /saswork/SAS_workD70C00017DE7_odaws02-euw1.oda.sas.com/SAS_work411400017DE7_odaws02-euw1.oda.sas.com/
SAS Version           = 9.04.01M6P11072018
SASPy Version         = 3.7.7
Teach me SAS          = False
Batch                 = False
Results               = Pandas
SAS Session Encoding  = utf-8
Python Encoding value = utf-8
SAS process Pid value = 97767

In [5]:
saspy.__version__

'3.7.7'

In [6]:
cars = sas.sasdata('cars', 'sashelp')
cars.head()

,Make,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,36945.0,33337.0,3.5,6.0,265.0,17.0,23.0,4451.0,106.0,189.0
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,23820.0,21761.0,2.0,4.0,200.0,24.0,31.0,2778.0,101.0,172.0
2,Acura,TSX 4dr,Sedan,Asia,Front,26990.0,24647.0,2.4,4.0,200.0,22.0,29.0,3230.0,105.0,183.0
3,Acura,TL 4dr,Sedan,Asia,Front,33195.0,30299.0,3.2,6.0,270.0,20.0,28.0,3575.0,108.0,186.0
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,43755.0,39014.0,3.5,6.0,225.0,18.0,24.0,3880.0,115.0,197.0

In [7]:
beep = pd.read_csv('beeps2005.csv', encoding='cp1252');

/home/vlad/.miniconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3170: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [39]:
df = beep[beep['a1'].isin([50, 54, 59, 70, 72, 73, 74, 75, 76])]

In [40]:
df = df.loc[:, ['a1', 's5b', 'q43a', 'q57a']]

In [41]:
df['s5b'] = df['s5b'].apply(lambda x: 1 if x >= 50 else 0)

In [42]:
df.loc[df['a1'] == 50, 'a1'] = 'Belarus'
df.loc[df['a1'] == 54, 'a1'] = 'Ukraine'
df.loc[df['a1'] == 59, 'a1'] = 'Poland'
df.loc[df['a1'] == 70, 'a1'] = 'Estonia'
df.loc[df['a1'] == 72, 'a1'] = 'Czechia'
df.loc[df['a1'] == 73, 'a1'] = 'Hungary'
df.loc[df['a1'] == 74, 'a1'] = 'Latvia'
df.loc[df['a1'] == 75, 'a1'] = 'Lithuania'
df.loc[df['a1'] == 76, 'a1'] = 'Slovakia'

In [43]:
def f(x):
    if not math.isnan(x):
        return np.log(x)
    pass

In [44]:
df[['q43a', 'q57a']] = df[['q43a', 'q57a']] .applymap(f)

/home/vlad/.miniconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: RuntimeWarning: divide by zero encountered in log
  This is separate from the ipykernel package so we can avoid doing imports until

In [45]:
df.isna().sum()

a1        0
s5b       0
q43a    182
q57a    791
dtype: int64

In [47]:
df

            a1  s5b      q43a      q57a
740    Belarus    0  4.605170       NaN
741    Belarus    0  4.317488  4.605170
742    Belarus    0  4.605170  7.910224
743    Belarus    0  4.605170  2.708050
744    Belarus    0  4.094345       NaN
...        ...  ...       ...       ...
9127  Slovakia    0  4.605170  6.469250
9128  Slovakia    0  4.605170  7.924796
9129  Slovakia    0       NaN  8.809564
9130  Slovakia    0       NaN  8.475954
9131  Slovakia    0  4.553877  9.776222

[3696 rows x 4 columns]